ay2609/esp32-sovereign-watch/components/st7789/st7789.c
// This is Bresenham's line drawing algorithm.
// Draw line
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End	X coordinate
// y2:End	Y coordinate
// color:color 
void lcdDrawLine(TFT_t * dev, int16_t x1, int16_t y1, int16_t x2, int16_t y2, colorSize color) {
	int i;
	int dx,dy;
	int sx,sy;
	int E;

	/* distance between two points */
	dx = ( x2 > x1 ) ? x2 - x1 : x1 - x2;
	dy = ( y2 > y1 ) ? y2 - y1 : y1 - y2;

	/* direction of two point */
	sx = ( x2 > x1 ) ? 1 : -1;
	sy = ( y2 > y1 ) ? 1 : -1;

	/* inclination < 1 */
	if ( dx > dy ) {
		E = -dx;
		for ( i = 0 ; i <= dx ; i++ ) {
			lcdDrawPixel(dev, x1, y1, color);
			x1 += sx;
			E += 2 * dy;
			if ( E >= 0 ) {
			y1 += sy;
			E -= 2 * dx;
		    }
	    }

	/* inclination >= 1 */
	} else {
		E = -dy;
		for ( i = 0 ; i <= dy ; i++ ) {
			lcdDrawPixel(dev, x1, y1, color);
			y1 += sy;
			E += 2 * dx;
			if ( E >= 0 ) {
				x1 += sx;
				E -= 2 * dy;
			}
		}
	}
}

void lcdDrawLineAngle(TFT_t * dev, int16_t x1, int16_t y1, int16_t x2, int16_t y2,
                      uint16_t xc, uint16_t yc, int16_t angle, colorSize color) {

    double xd1, yd1, xd2, yd2;
    double rd;

    rd = -angle * M_PI / 180.0; // 0
    xd1 = (int)( x1 * cos(rd) -  y1 * sin(rd) + xc); // x1 + xc
    yd1 = (int)( x1 * sin(rd) +  y1 * cos(rd) + yc); // y1 + yc

//    xd1 = 0;
//    yd1 = 0;

    xd2 = (int)( x2 * cos(rd) - y2 * sin(rd) + xc); // x2 + xc
    yd2 = (int)( x2 * sin(rd) + y2 * cos(rd) + yc); // y2 + yc

//    ESP_LOGI("LineAngle", "(%f, %f) -> (%f, %f)", xd1, yd1, xd2, yd2);

    lcdDrawLine(dev, (int) xd1, (int) yd1, (int) xd2, (int) yd2, color);
}


// Draw rectangle
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End	X coordinate
// y2:End	Y coordinate
// color:color
void lcdDrawRect(TFT_t * dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, colorSize color) {
	lcdDrawLine(dev, x1, y1, x2, y1, color);
	lcdDrawLine(dev, x2, y1, x2, y2, color);
	lcdDrawLine(dev, x2, y2, x1, y2, color);
	lcdDrawLine(dev, x1, y2, x1, y1, color);
}

// Draw rectangle with angle
// xc:Center X coordinate
// yc:Center Y coordinate
// w:Width of rectangle
// h:Height of rectangle
// angle:Angle of rectangle
// color:color

//When the origin is (0, 0), the point (x1, y1) after rotating the point (x, y) by the angle is obtained by the following calculation.
// x1 = x * cos(angle) - y * sin(angle)
// y1 = x * sin(angle) + y * cos(angle)
void lcdDrawRectAngle(TFT_t * dev, uint16_t xc, uint16_t yc, uint16_t w, uint16_t h, int16_t angle, colorSize color) {
	double xd,yd,rd;
	int x1,y1;
	int x2,y2;
	int x3,y3;
	int x4,y4;
	rd = -angle * M_PI / 180.0;
	xd = 0.0 - w/2;
	yd = h/2;
	x1 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y1 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	yd = 0.0 - yd;
	x2 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y2 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	xd = w/2;
	yd = h/2;
	x3 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y3 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	yd = 0.0 - yd;
	x4 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y4 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	lcdDrawLine(dev, x1, y1, x2, y2, color);
	lcdDrawLine(dev, x1, y1, x3, y3, color);
	lcdDrawLine(dev, x2, y2, x4, y4, color);
	lcdDrawLine(dev, x3, y3, x4, y4, color);
}

int ymin(int y1, int y2, int y3) {
    return (y1 < y2) ? (y1 < y3 ? y1 : y3) : (y2 < y3 ? y2 : y3);
}

// Helper function to find the maximum y-coordinate (top of the triangle)
int ymax(int y1, int y2, int y3) {
    return (y1 > y2) ? (y1 > y3 ? y1 : y3) : (y2 > y3 ? y2 : y3);
}

// Helper function to find the x-coordinate of the intersection of a line with a given y-coordinate




typedef struct {
    int x;
    int y;
} coord;

int findIntersection(coord* p1, coord* p2, int y) {
    if (p1->y == p2->y) return p2->x; // Handle horizontal line case
    return p1->x + (y - p1->y) * (p2->x - p1->x) / (p2->y - p1->y);  // Linear interpolation formula
}

void sortCoordinates3(coord *a, coord *b, coord *c) {
    coord temp;

    // Ensure a has the smallest y
    if (a->y > b->y) { temp = *a; *a = *b; *b = temp; }
    if (a->y > c->y) { temp = *a; *a = *c; *c = temp; }

    // Ensure c has the largest y
    if (b->y > c->y) { temp = *b; *b = *c; *c = temp; }
}

void sortCoordinates4(coord *a, coord *b, coord *c, coord *d) {
    coord temp;

    // Ensure a has the smallest y
    if (a->y > b->y) { temp = *a; *a = *b; *b = temp; }
    if (c->y > d->y) { temp = *c; *c = *d; *d = temp; }
    if (a->y > c->y) { temp = *a; *a = *c; *c = temp; }
    if (b->y > d->y) { temp = *b; *b = *d; *d = temp; }
    if (b->y > c->y) { temp = *b; *b = *c; *c = temp; }
}

void sortPoints4(int *a, int *b, int *c, int *d) {
    int temp;

    // Ensure a has the smallest y
    if (*a > *b) { temp = *a; *a = *b; *b = temp; }
    if (*c > *d) { temp = *c; *c = *d; *d = temp; }
    if (*a > *c) { temp = *a; *a = *c; *c = temp; }
    if (*b > *d) { temp = *b; *b = *d; *d = temp; }
    if (*b > *c) { temp = *b; *b = *c; *c = temp; }
}

void lcdDrawTriangle(TFT_t * dev, uint16_t xc, uint16_t yc, uint16_t w, uint16_t h, uint16_t angle, colorSize color) {
	double xd,yd,rd;
	int x1,y1;
	int x2,y2;
	int x3,y3;

    rd = -angle * M_PI / 180.0;
	xd = 0.0;
	yd = h/2;
	x1 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y1 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	xd = w/2;
	yd = 0.0 - yd;
	x2 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y2 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	xd = 0.0 - w/2;
	x3 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
	y3 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

	lcdDrawLine(dev, x1, y1, x2, y2, color);
	lcdDrawLine(dev, x1, y1, x3, y3, color);
	lcdDrawLine(dev, x2, y2, x3, y3, color);

    coord p1 = {x1, y1};
    coord p2 = {x2, y2};
    coord p3 = {x3, y3};

    sortCoordinates3(&p1, &p2, &p3);


#if 1
    // Fill the triangle with color

    for (int y = ymin(y1, y2, y3); y <= ymax(y1, y2, y3); y++) {
        // Find the x-coordinate at the left and right intersections of the horizontal line

        int sect1 = findIntersection(&p1, &p3, y);
        int sect2 = findIntersection(&p1, &p2, y);
        int sect3 = findIntersection(&p2, &p3, y);

        int leftX = (sect1 >= sect2 && sect1 >= sect3) ? ( (sect2 > sect3) ? (sect2) : (sect3) ) : ( (sect2 > sect3) ? (sect3) : (sect2) );
        int rightX = sect1;

        // swap order if necessary
        if (leftX > rightX) {
            int temp = leftX;
            leftX = rightX;
            rightX = temp;
        }

        // Draw the pixels between leftX and rightX at this y-coordinate
        for (int x = leftX; x <= rightX; x++) {
            lcdDrawPixel(dev, x, y, color);
        }
    }
#endif

//    lcdDrawPixel(dev, x1, y1, RED);
//    lcdDrawPixel(dev, x2, y2, BLUE);
//    lcdDrawPixel(dev, x3, y3, GREEN);

