ay2609/esp32-sovereign-watch/components/st7789/st7789.c
}

void lcdDrawTriangleAtAngle(TFT_t * dev, int16_t x1, int16_t y1,
                            int16_t x2, int16_t y2,
                            int16_t x3, int16_t y3,
                            uint16_t xc, uint16_t yc,
                            int16_t angle, colorSize color) {

    double rd;
    int xd1,yd1;
    int xd2,yd2;
    int xd3,yd3;

    rd = -angle * M_PI / 180.0;

    xd1 = (int)(x1 * cos(rd) - y1 * sin(rd) + xc);
    yd1 = (int)(x1 * sin(rd) + y1 * cos(rd) + yc);

    xd2 = (int)(x2 * cos(rd) - y2 * sin(rd) + xc);
    yd2 = (int)(x2 * sin(rd) + y2 * cos(rd) + yc);

    xd3 = (int)(x3 * cos(rd) - y3 * sin(rd) + xc);
    yd3 = (int)(x3 * sin(rd) + y3 * cos(rd) + yc);

    lcdDrawLine(dev, xd1, yd1, xd2, yd2, color);
    lcdDrawLine(dev, xd1, yd1, xd3, yd3, color);
    lcdDrawLine(dev, xd2, yd2, xd3, yd3, color);

    coord p1 = {xd1, yd1};
    coord p2 = {xd2, yd2};
    coord p3 = {xd3, yd3};

    sortCoordinates3(&p1, &p2, &p3);


    // Fill the triangle with color
#if 0
    for (int y = p1.y; y <= p3.y; y++) {
        // Find the x-coordinate at the left and right intersections of the horizontal line

        int sect1 = findIntersection(&p1, &p3, y);
        int sect2 = findIntersection(&p1, &p2, y);
        int sect3 = findIntersection(&p2, &p3, y);

        int leftX = (sect1 >= sect2 && sect1 >= sect3) ? ( (sect2 > sect3) ? (sect2) : (sect3) ) : ( (sect2 > sect3) ? (sect3) : (sect2) );
        int rightX = sect1;

        // swap order if necessary
        if (leftX > rightX) {
            int temp = leftX;
            leftX = rightX;
            rightX = temp;
        }

        // Draw the pixels between leftX and rightX at this y-coordinate
        for (int x = leftX; x <= rightX; x++) {
            lcdDrawPixel(dev, x, y, color);
        }
    }
#endif
}

void lcdDrawFillRectAngle(TFT_t * dev, uint16_t xc, uint16_t yc,
                          uint16_t w, uint16_t h,
                          int16_t x_offset, int16_t y_offset,
                          int16_t angle, colorSize color) {

    double xd,yd,rd;
    int x1,y1;
    int x2,y2;
    int x3,y3;
    int x4,y4;

    rd = -angle * M_PI / 180.0;
    xd = 0.0 - w/2 + x_offset;
    yd = 0.0 + h/2 + y_offset;
    x1 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
    y1 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

    yd = 0.0 - h/2 + y_offset;
    x2 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
    y2 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

    xd = 0.0 + w/2 + x_offset;
    yd = 0.0 + h/2 + y_offset;
    x3 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
    y3 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

    yd = 0.0 - h/2 + y_offset;
    x4 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
    y4 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

    coord p1 = {x1, y1};
    coord p2 = {x2, y2};
    coord p3 = {x3, y3};
    coord p4 = {x4, y4};

    sortCoordinates4(&p1, &p2, &p3, &p4);

    for (int y = p1.y; y < p4.y; y++) {

        int sect1 = findIntersection(&p1, &p2, y);
        int sect2 = findIntersection(&p1, &p3, y);
        int sect3 = findIntersection(&p2, &p4, y);
        int sect4 = findIntersection(&p3, &p4, y);

        sortPoints4(&sect1, &sect2, &sect3, &sect4);

        // Draw the pixels between leftX and rightX at this y-coordinate

//        ESP_LOGI("Rectangle", "%d %d %d %d", sect1, sect2, sect3, sect4);

        if (y < p1.y + 2 || y > p4.y - 2 || abs(sect2 - sect3) > 2) {
            for (int x = sect2; x <= sect3; x++) {
                lcdDrawPixel(dev, x, y, color);
            }
        } else {
            for (int x = sect1; x <= sect4; x++) {
                lcdDrawPixel(dev, x, y, color);
            }
        }

    }


}



// Draw regular polygon
// xc:Center X coordinate
// yc:Center Y coordinate
// n:Number of slides
// r:radius
// angle:Angle of regular polygon
// color:color
void lcdDrawRegularPolygon(TFT_t *dev, uint16_t xc, uint16_t yc, uint16_t n, uint16_t r, int16_t angle, colorSize color)
{
	double xd, yd, rd;
	int x1, y1;
	int x2, y2;
	int i;

	rd = -angle * M_PI / 180.0;
	for (i = 0; i < n; i++)
	{
		xd = r * cos(2 * M_PI * i / n);
		yd = r * sin(2 * M_PI * i / n);
		x1 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
		y1 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

		xd = r * cos(2 * M_PI * (i + 1) / n);
		yd = r * sin(2 * M_PI * (i + 1) / n);
		x2 = (int)(xd * cos(rd) - yd * sin(rd) + xc);
		y2 = (int)(xd * sin(rd) + yd * cos(rd) + yc);

		lcdDrawLine(dev, x1, y1, x2, y2, color);
	}
}

// Draw circle
// x0:Central X coordinate
// y0:Central Y coordinate
// r:radius
// color:color
void lcdDrawCircle(TFT_t * dev, uint16_t x0, uint16_t y0, uint16_t r, colorSize color) {
	int x;
	int y;
	int err;
	int old_err;

	x=0;
	y=-r;
	err=2-2*r;
	do{
		lcdDrawPixel(dev, x0-x, y0+y, color); 
		lcdDrawPixel(dev, x0-y, y0-x, color); 
		lcdDrawPixel(dev, x0+x, y0-y, color); 
		lcdDrawPixel(dev, x0+y, y0+x, color); 
		if ((old_err=err)<=x)	err+=++x*2+1;
		if (old_err>y || err>x) err+=++y*2+1;	 
	} while(y<0);
}

// Draw circle of filling
// x0:Central X coordinate
// y0:Central Y coordinate
// r:radius
// color:color
void lcdDrawFillCircle(TFT_t * dev, uint16_t x0, uint16_t y0, uint16_t r, colorSize color) {
	int x;
	int y;
	int err;
	int old_err;
	int ChangeX;

	x=0;
	y=-r;
	err=2-2*r;
	ChangeX=1;
	do{
		if(ChangeX) {
			lcdDrawLine(dev, x0-x, y0-y, x0-x, y0+y, color);
			lcdDrawLine(dev, x0+x, y0-y, x0+x, y0+y, color);
		} // endif
		ChangeX=(old_err=err)<=x;
		if (ChangeX)			err+=++x*2+1;
		if (old_err>y || err>x) err+=++y*2+1;
	} while(y<=0);
} 

// Draw rectangle with round corner
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End	X coordinate
// y2:End	Y coordinate
// r:radius
// color:color
void lcdDrawRoundRect(TFT_t * dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t r, colorSize color) {
	int x;
	int y;
	int err;
	int old_err;
	unsigned char temp;

	if(x1>x2) {
		temp=x1; x1=x2; x2=temp;
	} // endif
	  
	if(y1>y2) {
		temp=y1; y1=y2; y2=temp;
	} // endif

	ESP_LOGD(TAG, "x1=%d x2=%d delta=%d r=%d",x1, x2, x2-x1, r);
	ESP_LOGD(TAG, "y1=%d y2=%d delta=%d r=%d",y1, y2, y2-y1, r);
	if (x2-x1 < r) return; // Add 20190517
	if (y2-y1 < r) return; // Add 20190517

	x=0;
	y=-r;
	err=2-2*r;

	do{
		if(x) {
			lcdDrawPixel(dev, x1+r-x, y1+r+y, color); 
			lcdDrawPixel(dev, x2-r+x, y1+r+y, color); 
			lcdDrawPixel(dev, x1+r-x, y2-r-y, color); 
			lcdDrawPixel(dev, x2-r+x, y2-r-y, color);
		} // endif 
		if ((old_err=err)<=x)	err+=++x*2+1;
		if (old_err>y || err>x) err+=++y*2+1;	 
	} while(y<0);

	ESP_LOGD(TAG, "x1+r=%d x2-r=%d",x1+r, x2-r);
	lcdDrawLine(dev, x1+r,y1  ,x2-r,y1	,color);
	lcdDrawLine(dev, x1+r,y2  ,x2-r,y2	,color);
	ESP_LOGD(TAG, "y1+r=%d y2-r=%d",y1+r, y2-r);
	lcdDrawLine(dev, x1  ,y1+r,x1  ,y2-r,color);
	lcdDrawLine(dev, x2  ,y1+r,x2  ,y2-r,color);  
} 

