ay2609/esp32-sovereign-watch/components/st7789/st7789.c
    // Return next position (based on the character width)
    return x + width + 2;
}

int lcdDrawCharBDF3(TFT_t * dev, bdf_t * file_data, uint8_t ascii, uint16_t x, uint16_t y, colorSize color) {

    uint32_t index = file_data->index[ascii - 43];
    uint8_t width = file_data->chars[index];
    uint8_t height = file_data->chars[index + 1];
//    int8_t xOff = file_data->chars[index + 2];
    int8_t yOff = file_data->chars[index + 3];
    uint8_t length = file_data->lengths[ascii - 43];

    uint16_t xx = x;
    uint16_t yy = y - 10;

//    ESP_LOGI("FUCKING WHATEVER", "%c HEIGHT %d", (char) ascii, height);

    for (int row = 10; row > 0; row--) {
        uint32_t rowBitmap = file_data->chars[index + row + 3];  // Each row's pixel data
        xx = x;  // Reset X for each new row
        for (int col = 0; col < width; col++) {
            if (rowBitmap & (1 << ((length * 4) - 1 - col))) {  // Check each bit from left to right
                lcdDrawPixel(dev, xx, yy, color);
            }
            xx++;
        }
        yy--;  // Move to the next row up
    }

    // Return next position (based on the character width)
    return x + width + 2;
}

int lcdDrawString(TFT_t * dev, const char * filepath, uint16_t x, uint16_t y, uint8_t * ascii, colorSize color) {
	int length = strlen((char *)ascii);
    BDFChar bdfChar;
	for(int i=0;i<length;i++) {
		if (dev->_font_direction == 0) {
            loadBDFChar(filepath, ascii[i], &bdfChar);
            x = lcdDrawCharBDF(dev, &bdfChar, x, y, color);
        }
	}
	if (dev->_font_direction == 0) return x;
	return 0;
}

int lcdDrawString2(TFT_t * dev, bdf_t *file_data, BDFChar* bdfChar, uint16_t x, uint16_t y, uint8_t * ascii, colorSize color) {
    int length = strlen((char *)ascii);

    for(int i=0;i<length;i++) {
        if (dev->_font_direction == 0) {
            x = lcdDrawCharBDF2(dev, file_data, ascii[i], x, y + bdfChar->height, color);
        }
    }
    if (dev->_font_direction == 0) return x;
    return 0;
}

int lcdDrawString3(TFT_t * dev, bdf_t *file_data, BDFChar* bdfChar, uint16_t x, uint16_t y, uint8_t * ascii, colorSize color) {
    int length = strlen((char *)ascii);

    for(int i=0;i<length;i++) {
        if (dev->_font_direction == 0) {
            x = lcdDrawCharBDF3(dev, file_data, ascii[i], x, y + bdfChar->height, color);
        }
    }
    if (dev->_font_direction == 0) return x;
    return 0;
}


// Draw Non-Alphanumeric character
// x:X coordinate
// y:Y coordinate
// code:character code
// color:color
int lcdDrawCode(TFT_t * dev, FontxFile *fx, uint16_t x,uint16_t y,uint8_t code,colorSize color) {
	if(_DEBUG_)printf("code=%x x=%d y=%d\n",code,x,y);
	if (dev->_font_direction == 0)
		x = lcdDrawChar(dev, fx, x, y, code, color);
	if (dev->_font_direction == 1)
		y = lcdDrawChar(dev, fx, x, y, code, color);
	if (dev->_font_direction == 2)
		x = lcdDrawChar(dev, fx, x, y, code, color);
	if (dev->_font_direction == 3)
		y = lcdDrawChar(dev, fx, x, y, code, color);
	if (dev->_font_direction == 0) return x;
	if (dev->_font_direction == 2) return x;
	if (dev->_font_direction == 1) return y;
	if (dev->_font_direction == 3) return y;
	return 0;
}

#if 0
// Draw UTF8 character
// x:X coordinate
// y:Y coordinate
// utf8:UTF8 code
// color:color
int lcdDrawUTF8Char(TFT_t * dev, FontxFile *fx, uint16_t x,uint16_t y,uint8_t *utf8,colorSize color) {
	uint16_t sjis[1];

	sjis[0] = UTF2SJIS(utf8);
	if(_DEBUG_)printf("sjis=%04x\n",sjis[0]);
	return lcdDrawSJISChar(dev, fx, x, y, sjis[0], color);
}

// Draw UTF8 string
// x:X coordinate
// y:Y coordinate
// utfs:UTF8 string
// color:color
int lcdDrawUTF8String(TFT_t * dev, FontxFile *fx, uint16_t x, uint16_t y, unsigned char *utfs, colorSize color) {

	int i;
	int spos;
	uint16_t sjis[64];
	spos = String2SJIS(utfs, strlen((char *)utfs), sjis, 64);
	if(_DEBUG_)printf("spos=%d\n",spos);
	for(i=0;i<spos;i++) {
		if(_DEBUG_)printf("sjis[%d]=%x y=%d\n",i,sjis[i],y);
		if (dev->_font_direction == 0)
			x = lcdDrawSJISChar(dev, fx, x, y, sjis[i], color);
		if (dev->_font_direction == 1)
			y = lcdDrawSJISChar(dev, fx, x, y, sjis[i], color);
		if (dev->_font_direction == 2)
			x = lcdDrawSJISChar(dev, fx, x, y, sjis[i], color);
		if (dev->_font_direction == 3)
			y = lcdDrawSJISChar(dev, fx, x, y, sjis[i], color);
	}
	if (dev->_font_direction == 0) return x;
	if (dev->_font_direction == 2) return x;
	if (dev->_font_direction == 1) return y;
	if (dev->_font_direction == 3) return y;
	return 0;
}
#endif

// Set font direction
// dir:Direction
void lcdSetFontDirection(TFT_t * dev, uint16_t dir) {
	dev->_font_direction = dir;
}

// Set font filling
// color:fill color
void lcdSetFontFill(TFT_t * dev, colorSize color) {
	dev->_font_fill = true;
	dev->_font_fill_color = color;
}

// UnSet font filling
void lcdUnsetFontFill(TFT_t * dev) {
	dev->_font_fill = false;
}

// Set font underline
// color:frame color
void lcdSetFontUnderLine(TFT_t * dev, colorSize color) {
	dev->_font_underline = true;
	dev->_font_underline_color = color;
}

// UnSet font underline
void lcdUnsetFontUnderLine(TFT_t * dev) {
	dev->_font_underline = false;
}

// Backlight OFF
void lcdBacklightOff(TFT_t * dev) {
	if(dev->_bl >= 0) {
		gpio_set_level( dev->_bl, 0 );
	}
}

// Backlight ON
void lcdBacklightOn(TFT_t * dev) {
	if(dev->_bl >= 0) {
		gpio_set_level( dev->_bl, 1 );
	}
}

// Display Inversion Off
void lcdInversionOff(TFT_t * dev) {
	spi_master_write_command(dev, 0x20); // Display Inversion Off
}

// Display Inversion On
void lcdInversionOn(TFT_t * dev) {
	spi_master_write_command(dev, 0x21); // Display Inversion On
}

void lcdWrapArround(TFT_t * dev, SCROLL_TYPE_t scroll, int start, int end) {
	if (dev->_use_frame_buffer == false) return;
	
	int _width = dev->_width;
	int _height = dev->_height;
	int32_t index1;
	int32_t index2;

	if (scroll == SCROLL_RIGHT) {
		uint16_t wk[_width];
		for (int i=start;i<end;i++) {
			index1 = i * _width;
			memcpy((char *)wk, (char*)&dev->_frame_buffer[index1], _width*2);
			index2 = index1 + _width - 1;
			dev->_frame_buffer[index1] = dev->_frame_buffer[index2];
			memcpy((char *)&dev->_frame_buffer[index1+1], (char *)&wk[0], (_width-1)*2);
		}
	} else if (scroll == SCROLL_LEFT) {
		uint16_t wk[_width];
		for (int i=start;i<end;i++) {
			index1 = i * _width;
			memcpy((char *)wk, (char*)&dev->_frame_buffer[index1], _width*2);
			index2 = index1 + _width - 1;
			dev->_frame_buffer[index2] = dev->_frame_buffer[index1];
			memcpy((char *)&dev->_frame_buffer[index1], (char *)&wk[1], (_width-1)*2);
		}
	} else if (scroll == SCROLL_UP) {
		uint16_t wk;
		for (int i=start;i<=end;i++) {
			wk = dev->_frame_buffer[i];
			for (int j=0;j<_height-1;j++) {
				index1 = j * _width + i;
				index2 = (j+1) * _width + i;
				dev->_frame_buffer[index1] = dev->_frame_buffer[index2];
			}
			index2 = (_height-1) * _width + i;
			dev->_frame_buffer[index2] = wk;
		}
	} else if (scroll == SCROLL_DOWN) {
		uint16_t wk;
		for (int i=start;i<=end;i++) {
			index2 = (_height-1) * _width + i;
			wk = dev->_frame_buffer[index2];
			for (int j=_height-2;j>=0;j--) {
				index1 = j * _width + i;
				index2 = (j+1) * _width + i;
				dev->_frame_buffer[index2] = dev->_frame_buffer[index1];
			}
			dev->_frame_buffer[i] = wk;
		}
	}
}

// Invert a rectangular area
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End X coordinate
// y2:End Y coordinate
// save:Save buffer
void lcdInversionArea(TFT_t * dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t *save) {
	if (x1 >= dev->_width) return;
	if (x2 >= dev->_width) x2=dev->_width-1;
	if (y1 >= dev->_height) return;
	if (y2 >= dev->_height) y2=dev->_height-1;

