ay2609/esp32-sovereign-watch/components/st7789/st7789.c
	int index = 0;
	ESP_LOGD(TAG,"offset(x)=%d offset(y)=%d",dev->_offsetx,dev->_offsety);
	if (dev->_use_frame_buffer) {
		for (int16_t j = y1; j <= y2; j++){
			for(int16_t i = x1; i <= x2; i++){
				if (save) save[index++] = dev->_frame_buffer[j*dev->_width+i];
				dev->_frame_buffer[j*dev->_width+i] = ~dev->_frame_buffer[j*dev->_width+i];
			}
		}
	} else {
		ESP_LOGW(TAG,"To use this feature, enable the FrameBuffer option.");
	}
}

// Get rectangle area from frame buffer
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End X coordinate
// y2:End Y coordinate
// save:Save buffer
void lcdGetRect(TFT_t * dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t *save) {
	if (x1 >= dev->_width) return;
	if (x2 >= dev->_width) x2=dev->_width-1;
	if (y1 >= dev->_height) return;
	if (y2 >= dev->_height) y2=dev->_height-1;

	int index = 0;
	ESP_LOGD(TAG,"offset(x)=%d offset(y)=%d",dev->_offsetx,dev->_offsety);
	if (dev->_use_frame_buffer) {
		for (int16_t j = y1; j <= y2; j++){
			for(int16_t i = x1; i <= x2; i++){
				save[index++] = dev->_frame_buffer[j*dev->_width+i];
			}
		}
	} else {
		ESP_LOGW(TAG,"Disable frame buffer");
	}
}

// Set rectangle area to frame buffer
// x1:Start X coordinate
// y1:Start Y coordinate
// x2:End X coordinate
// y2:End Y coordinate
// save:Save buffer
void lcdSetRect(TFT_t * dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t *save) {
	if (x1 >= dev->_width) return;
	if (x2 >= dev->_width) x2=dev->_width-1;
	if (y1 >= dev->_height) return;
	if (y2 >= dev->_height) y2=dev->_height-1;

	int index = 0;
	ESP_LOGD(TAG,"offset(x)=%d offset(y)=%d",dev->_offsetx,dev->_offsety);
	if (dev->_use_frame_buffer) {
		for (int16_t j = y1; j <= y2; j++){
			for(int16_t i = x1; i <= x2; i++){
				dev->_frame_buffer[j*dev->_width+i] = save[index++];
			}
		}
	} else {
		ESP_LOGW(TAG,"Disable frame buffer");
	}
}

// Draw circle as cursor
// x0:Central X coordinate
// y0:Central Y coordinate
// r:radius
// color:color
void lcdSetCursor(TFT_t * dev, uint16_t x0, uint16_t y0, uint16_t r, colorSize color, uint16_t *save) {
	lcdGetRect(dev, x0-r, y0-r, x0+r, y0+r, save);
	lcdDrawCircle(dev, x0, y0, r, color);
}

void lcdResetCursor(TFT_t * dev, uint16_t x0, uint16_t y0, uint16_t r, colorSize color, uint16_t *save) {
	lcdSetRect(dev, x0-r, y0-r, x0+r, y0+r, save);
	//lcdDrawCircle(dev, x0, y0, r, color);
}

// Draw Frame Buffer
void lcdDrawFinish(TFT_t *dev)
{
	if (dev->_use_frame_buffer == false) return;

	spi_master_write_command(dev, 0x2A); // set column(x) address
	spi_master_write_addr(dev, dev->_offsetx, dev->_offsetx+dev->_width-1);
	spi_master_write_command(dev, 0x2B); // set Page(y) address
	spi_master_write_addr(dev, dev->_offsety, dev->_offsety+dev->_height-1);
	spi_master_write_command(dev, 0x2C); // Memory Write

	uint32_t size = dev->_width*dev->_height;
	colorSize *image = dev->_frame_buffer;
	while (size > 0) {
		// 1024 bytes per time.
		uint16_t bs = (size > 1024) ? 1024 : size;
		spi_master_write_colors(dev, image, bs);
		size -= bs;
		image += bs;
	}
	return;
}

void getSlice(uint16_t *image, uint16_t *slice, int x_start, int y_start, int x_end, int y_end) {
    int slice_width = x_end - x_start + 1;
    int slice_height = y_end - y_start + 1;

    for (int y = 0; y < slice_height; y++) {
        for (int x = 0; x < slice_width; x++) {
            int src_index = (y_start + y) * CONFIG_WIDTH + (x_start + x);  // Calculate index in the original buffer
            int dst_index = y * slice_width + x;                    // Calculate index in the slice
            slice[dst_index] = image[src_index];
        }
    }
}

//void lcdDrawBlock(TFT_t *dev, int x_s, int y_s, int x_e, int y_e)
//{
//    spi_master_write_command(dev, 0x2A); // set column(x) address
//    spi_master_write_addr(dev, dev->_offsetx+x_s, dev->_offsetx+x_e-1);
//    spi_master_write_command(dev, 0x2B); // set Page(y) address
//    spi_master_write_addr(dev, dev->_offsety+y_s, dev->_offsety+y_e-1);
//    spi_master_write_command(dev, 0x2C); // Memory Write
//
//    uint32_t size = (x_e-x_s)*(y_e-y_s);
//    int slice_width = x_e - x_s;
//    int slice_height = y_e - y_s;
//
//    uint16_t *image = dev->_frame_buffer;
//    uint16_t *slice = (uint16_t*)malloc(slice_width * slice_height * sizeof(uint16_t));
//
//    getSlice(image, slice, x_s, y_s, x_e, y_e);
//
//    while (size > 0) {
//        // 1024 bytes per time.
//        uint16_t bs = (size > 1024) ? 1024 : size;
//        spi_master_write_colors(dev, slice, bs);
//        size -= bs;
//        image += bs;
//    }
//
//    free(slice);
//    return;
//}
